list_ = [
    {
        "название вакансии": "Frontend разработчик",
        "ссылка на вакансию": "https://hh.ru/vacancy/120350974",
        "зарплата": 400000,
        "требования": "Уверенная работа с Vue 3. Уверенная работа с Bootstrap 4. Опыт написания ent-to-end тестов для веб интерфейсов. "
    },
    {
        "название вакансии": "Flutter-разработчик, Middle",
        "ссылка на вакансию": "https://hh.ru/vacancy/120259056",
        "зарплата": 0,
        "требования": "Опыт работы не менее 1+ лет в разработке мобильных приложений на Flutter. Flutter v2. 5+. "
    },
    {
        "название вакансии": "Frontend-разработчик",
        "ссылка на вакансию": "https://hh.ru/vacancy/120347108",
        "зарплата": 500000,
        "требования": "Опыт разработки от 2 лет. Глубокие знания JavaScript и браузерного API. Опыт работы с Vue.js 3, включая Composition API. "
    },
    {
        "название вакансии": "Junior Game Designer",
        "ссылка на вакансию": "https://hh.ru/vacancy/120306445",
        "зарплата": 0,
        "требования": "Проводить ресерчи, искать идеи, генерировать идеи. Игровой опыт в разных жанрах. Интерес к GameDev и мобильным играм. Базовые навыки работы..."
    },
    {
        "название вакансии": "Python-разработчик",
        "ссылка на вакансию": "https://hh.ru/vacancy/120331701",
        "зарплата": 0,
        "требования": "Опыт работы с Python от 1-го года . Опыт работы с одним или несколькими фреймворками: FastApi, Flask, Django, Django REST. "
    }
]

list_2 = [        {
        "название вакансии": "Python-разработчик",
        "ссылка на вакансию": "https://hh.ru/vacancy/120331701",
        "зарплата": 0,
        "требования": "Опыт работы с Python от 1-го года . Опыт работы с одним или несколькими фреймворками: FastApi, Flask, Django, Django REST. "
    },
    {
        "название вакансии": "React developer",
        "ссылка на вакансию": "https://hh.ru/vacancy/120345907",
        "зарплата": 11000000,
        "требования": "Опыт работы с React не менее 3 лет. - Знание TypeScript, HTML и CSS на высоком уровне. - Опыт работы с redux. "
    }
]


# def add_vacancy(path, file):
#     """ добавления данных в файл"""
#     with open(path, 'a') as f:
#         json.dump(file, f, ensure_ascii=False, indent=4)
#         return "Файл добавлен"
